Reports/АР17_ОперативнаяЗадолженностьПоПериодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>АР17_ОперативнаяЗадолженностьПоПериодам</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/АР_РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/АР_РасчетыПоСчетамБух.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>АР_РасчетыПоСчетамБух</Name>
			<ChartOfAccounts>ChartOfAccounts.АР_РасчетыПоСчетам</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.АР_РасчетыПоСчетам.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/АР17_ПроведениеДоговораАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_ПроведениеДоговораАренды</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_УслугиПоАренде</xr:Item>
				<xr:Item>AccumulationRegister.АР_РасчетыПоДоговорам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документоснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАренды</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АР17_ОперативнаяЗадолженностьПоПериодам/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ТабРезультат = Новый ТаблицаЗначений;
    КЧ = Новый КвалификаторыЧисла(12,2);
    КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
    КС = Новый КвалификаторыСтроки(80);
    Массив = Новый Массив;
    Массив.Добавить(Тип("Число"));
    ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
    Массив.Очистить();
    Массив.Добавить(Тип("Дата"));
    ОписаниеТиповД = Новый ОписаниеТипов(Массив, , ,КД);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	ТабРезультат.Колонки.Добавить("ВидДоговора",Новый описаниеТипов("СправочникСсылка.АР_ВидыДоговоров"));
	ТабРезультат.Колонки.Добавить("ИмущественныйКомплекс",Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Контрагент",Новый описаниеТипов("СправочникСсылка.Контрагенты"));
	ТабРезультат.Колонки.Добавить("Договор",Новый описаниеТипов("ДокументСсылка.АР17_ЗаключениеДоговораАренды"));
	ТабРезультат.Колонки.Добавить("Счет", ОписаниеТиповС); //Новый описаниеТипов("ДокументСсылка.АР17_СчетНаАренду"));
	
	ТабРезультат.Колонки.Добавить("Организация",Новый описаниеТипов("СправочникСсылка.Организации"));
	
	ТабРезультат.Колонки.Добавить("Задолженность",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("СрокОплаты",ОписаниеТиповД);
	ТабРезультат.Колонки.Добавить("ПросроченныйПериод",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("ПросроченнаяЗадолженность",ОписаниеТиповЧ);
	
	ТабРезультат.Колонки.Добавить("Период1",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Период2",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Период3",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Период4",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Ответственный", ОписаниеТиповС);
	
	ТабРезультат.Колонки.Добавить("НачалоПериода", ОписаниеТиповД);

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	АР17_ЗаключениеДоговораАренды.Ссылка,
		//|	МАКСИМУМ(АР17_ЗаключениеДоговораАренды.СуммаЗалога) КАК СуммаЗалога,
		//|	АР17_ЗаключениеДоговораАренды.ОбщаяПлощадь,
		//|	АР17_ЗаключениеДоговораАренды.Дата
		//|ИЗ
		//|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		//|ГДЕ
		//|	АР17_ЗаключениеДоговораАренды.ФактическоеОкончание <= &ДатаКон
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	АР17_ЗаключениеДоговораАренды.Ссылка,
		//|	АР17_ЗаключениеДоговораАренды.ОбщаяПлощадь,
		//|	АР17_ЗаключениеДоговораАренды.Дата";
		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АР_РасчетыПоДоговорамОстаткиИОбороты.Месяц) КАК Месяц,
	|	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.ОстаткиИОбороты(, &ДатаКон, , , ) КАК АР_РасчетыПоДоговорамОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|		ПО АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента,
	|	АР17_ЗаключениеДоговораАренды.Ссылка";
		
	
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	Настройки = КомпоновщикНастроек.Настройки; 
	
	//+ конец периода
	ИдНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту
	(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтандартныйПериод")));
	ПараметрСКД = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройки);
	КонецПериода = ПараметрСКД.Значение.ДатаОкончания;
	НачалоПериода = ПараметрСКД.Значение.ДатаНачала;
	//- конец периода
	
	Запрос.УстановитьПараметр("ДатаКон",Дата(КонецПериода));
	//Запрос.УстановитьПараметр("ДоговорКонтрагента",Справочники.ДоговорыКонтрагентов.НайтиПоКоду("00-000046"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДог = РезультатЗапроса.Выбрать();
	Пока ВыборкаДог.Следующий() Цикл
		
		Задолженность = 0;
		//////////////////////////////+
		ТЗ = ПолучитьОЗ(ВыборкаДог.Ссылка,КонецПериода);
	
		//Мес = РазбитьПериод(ВыборкаДог.Ссылка.Дата, Мин(КонецПериода, ВыборкаДог.Ссылка.ФактическоеОкончание));
		Мес = РазбитьПериод(НачалоПериода, Мин(КонецПериода, ВыборкаДог.Ссылка.ФактическоеОкончание));
		Для Каждого СтрМес из Мес Цикл
			Нач = НачалоМесяца(СтрМес.НачалоПериода);
			Если ТЗ.Найти(Нач, "НачалоПериода") = Неопределено Тогда
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока.НачалоПериода = СтрМес.НачалоПериода;
				НоваяСтрока.СуммаОстаток = ПолучитьСуммуЗаМесяц(ВыборкаДог.Ссылка, КонецМесяца(СтрМес.НачалоПериода));
			КонецЕсли;
		КонецЦикла;
		
		ТЗ.Сортировать("НачалоПериода Возр");
		
		Для Каждого Стр из ТЗ Цикл
			
			НовСтрока=ТабРезультат.Добавить();
			НовСтрока.ВидДоговора = ВыборкаДог.Ссылка.ВидДоговора;
			НовСтрока.ИмущественныйКомплекс = ВыборкаДог.Ссылка.ИК;
			НовСтрока.Контрагент = ВыборкаДог.Ссылка.Контрагент;
			НовСтрока.Договор = ВыборкаДог.Ссылка;
			Если Стр.СчетНаАренду = Неопределено Тогда
				НовСтрока.Счет = Формат(Стр.НачалоПериода, "ДФ='ММММ yyyy'");
			Иначе
				НовСтрока.Счет = Стр.СчетНаАренду;
				//НовСтрока.Задолженность = Макс(Стр.СуммаОстаток, -Стр.СуммаОстаток);
			КонецЕсли;	
				
			НовСтрока.Организация = ВыборкаДог.Ссылка.Организация;
			НовСтрока.НачалоПериода = Стр.НачалоПериода;
			
			
			НовСтрока.СрокОплаты = Стр.НачалоПериода + ВыборкаДог.Ссылка.СрокОплаты*60*60*24 - (60*60*24) + ВыборкаДог.Ссылка.ОтсрочкаПоОплате*60*60*24;
			НовСтрока.ПросроченныйПериод = (НачалоДня(КонецПериода)-НачалоДня(НовСтрока.СрокОплаты))/(60*60*24);//Стр.Ссылка.ПросроченнаяПериод;
			ПросроченныйПериод_ = НовСтрока.СрокОплаты + НовСтрока.ПросроченныйПериод*60*60*24;
			//НовСтрока.ПросроченнаяЗадолженность = ПолучитьСуммуЗаМесяц_(ВыборкаДог.Ссылка,ПросроченныйПериод_);
			НовСтрока.ПросроченнаяЗадолженность = ПолучитьСуммуЗаМесяц(ВыборкаДог.Ссылка, КонецМесяца(Стр.НачалоПериода));//ПолучитьСуммуОборот(ВыборкаДог.Ссылка,НачалоМесяца(Стр.НачалоПериода),КонецМесяца(Стр.НачалоПериода));
			
			Период4 = 0;
			Если НовСтрока.ПросроченныйПериод < 0 Тогда
				НовСтрока.ПросроченнаяЗадолженность = 0;
			ИначеЕсли НовСтрока.ПросроченныйПериод >= 0 и НовСтрока.ПросроченныйПериод < 8 Тогда
				НовСтрока.Период1 = ПолучитьСуммуЗаМесяц_(ВыборкаДог.Ссылка,НовСтрока.СрокОплаты + 1*60*60*24);
				//НовСтрока.ПросроченнаяЗадолженность = НовСтрока.Период1;
				НовСтрока.Задолженность = НовСтрока.Период1;
				НовСтрока.Период1 = НовСтрока.ПросроченнаяЗадолженность;
			ИначеЕсли НовСтрока.ПросроченныйПериод >= 8 и НовСтрока.ПросроченныйПериод <= 15 Тогда	
				НовСтрока.Период2 = ПолучитьСуммуЗаМесяц_(ВыборкаДог.Ссылка,НовСтрока.СрокОплаты + 7*60*60*24);
				//НовСтрока.ПросроченнаяЗадолженность = НовСтрока.Период2;
				НовСтрока.Задолженность = НовСтрока.Период2;
				НовСтрока.Период2 = НовСтрока.ПросроченнаяЗадолженность;
			ИначеЕсли НовСтрока.ПросроченныйПериод >= 16 и НовСтрока.ПросроченныйПериод <= 30 Тогда		
				НовСтрока.Период3 = ПолучитьСуммуЗаМесяц_(ВыборкаДог.Ссылка,НовСтрока.СрокОплаты + 15*60*60*24);
				//НовСтрока.ПросроченнаяЗадолженность = НовСтрока.Период3;
				НовСтрока.Задолженность = НовСтрока.Период3;
				НовСтрока.Период3 = НовСтрока.ПросроченнаяЗадолженность;
			Иначе
				КолДней = Сред(КонецМесяца(НовСтрока.СрокОплаты+60*60*24), 1, 2);
				НовСтрока.Период4 = ПолучитьСуммуЗаМесяц_(ВыборкаДог.Ссылка,НовСтрока.СрокОплаты + КолДней*60*60*24);
				//НовСтрока.ПросроченнаяЗадолженность = НовСтрока.Период4;
				НовСтрока.Задолженность = НовСтрока.Период4;
				НовСтрока.Период4 = НовСтрока.ПросроченнаяЗадолженность;
				//
				
			КонецЕсли;
			
			НовСтрока.Ответственный = ВыборкаДог.Ссылка.Ответственный;
			
			Задолженность = Задолженность + ПолучитьСуммуЗаМесяц_(ВыборкаДог.Ссылка,НовСтрока.НачалоПериода);
			НовСтрока.Задолженность = Задолженность;
			НовСтрока.ПросроченныйПериод = ?(Задолженность = 0,0,НовСтрока.ПросроченныйПериод); // + NAI Becar Комментирование Смирнов А.А. от 24.07.2017 10:39
		КонецЦикла;	

	КонецЦикла;
	
	//ТабРезультат.Сортировать("Договор Возр, НачалоПериода Возр");
	
    ВнешниеНаборыДанных = Новый Структура; 
    ВнешниеНаборыДанных.Вставить("РеестрДоговоров", ТабРезультат); 

	СтандартнаяОбработка = Ложь;
    
     КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
     Настройки = КомпоновщикНастроек.Настройки; 
	 
 	 ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
    ДокументРезультат.Очистить();
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
КонецПроцедуры

Функция ПолучитьСуммуОборот(Договор, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	АР_РасчетыПоДоговорамОбороты.СуммаОборот
		//|ИЗ
		//|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, , ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_РасчетыПоДоговорамОбороты";
		
	"ВЫБРАТЬ
	|	АР_РасчетыПоДоговорамОбороты.Организация КАК Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_РасчетыПоДоговорамОбороты.Период КАК Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_Дог
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	|ГДЕ
	|	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.АР17_ПроведениеДоговораАренды
	|	И 
	|АР_РасчетыПоДоговорамОбороты.СуммаОборот > 0
	|	И 
	|АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дог.Регистратор.ДоговорАренды.Организация КАК Организация,
	|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент КАК Контрагент,
	|	ВТ_Дог.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ВТ_Дог.Регистратор.СуммаПоДоговору) КАК СуммаПоДоговору
	|ИЗ
	|	ВТ_Дог КАК ВТ_Дог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Дог.Регистратор.ДоговорКонтрагента,
	|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент,
	|	ВТ_Дог.Регистратор.ДоговорАренды.Организация";	

	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	//Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.СуммаПоДоговору;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции	

Функция ПолучитьСуммуЗаМесяц(Договор, Дата)

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	АР_РасчетыПоДоговорамОстатки.СуммаОстаток
	//	|ИЗ
	//	|	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(
	//	|			&Дата,
	//	|			ДоговорКонтрагента = &ДоговорКонтрагента
	//	//|				И Месяц = &Месяц
	//	|) КАК АР_РасчетыПоДоговорамОстатки";
	//
	//Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("Дата", Дата);
	////Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	//
	//РЗ = Запрос.Выполнить().Выбрать();
	//
	//Если РЗ.Следующий() Тогда
	//	Возврат РЗ.СуммаОстаток;
	//Иначе 
	//	Возврат 0;
	//КонецЕсли;
	
	//////////////////////////////////////////
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	АР_РасчетыПоДоговорамОбороты.Организация КАК Организация,
	//|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	//|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	////|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору КАК СуммаПоДоговору,
	//|	АР_РасчетыПоДоговорамОбороты.СуммаОборот КАК СуммаПоДоговору,
	//|	АР_РасчетыПоДоговорамОбороты.Период КАК Период,
	//|	АР_РасчетыПоДоговорамОбороты.Регистратор
	//|ПОМЕСТИТЬ ВТ_Дог
	//|ИЗ
	//|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	//|ГДЕ
	//|(АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.АР17_ПроведениеДоговораАренды
	//|		ИЛИ АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет)
	//|И АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	//|И АР_РасчетыПоДоговорамОбороты.СуммаОборот > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	//|	АР_РасчетыПоДоговорамОбороты.Организация,
	//|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	//|	АР_РасчетыПоДоговорамОбороты.Период,
	//|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	////|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору
	//|	АР_РасчетыПоДоговорамОбороты.СуммаОборот
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Организация КАК Организация,
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент КАК Контрагент,
	//|	ВТ_Дог.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|	СУММА(ВТ_Дог.Регистратор.СуммаПоДоговору) КАК СуммаПоДоговору
	//|ИЗ
	//|	ВТ_Дог КАК ВТ_Дог
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Дог.Регистратор.ДоговорКонтрагента,
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент,
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Организация";	
	//
	//Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	//
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	//Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	////Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	//
	//РЗ = Запрос.Выполнить().Выбрать();
	//
	//Если РЗ.Следующий() Тогда
	//	Возврат РЗ.СуммаПоДоговору;
	//Иначе
	//	Возврат 0;
	//КонецЕсли;

	//////////////////////////////////////////

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_РасчетыПоДоговорамОбороты.Организация КАК Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот КАК СуммаПоДоговору,
	|	АР_РасчетыПоДоговорамОбороты.Период КАК Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_Дог
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	|ГДЕ
	|	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.АР17_ПроведениеДоговораАренды
	|	И АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И АР_РасчетыПоДоговорамОбороты.СуммаОборот > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	|ГДЕ
	|	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|	И АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дог.Организация КАК Организация,
	|	ВТ_Дог.Контрагент КАК Контрагент,
	|	ВТ_Дог.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ВТ_Дог.СуммаПоДоговору) КАК СуммаПоДоговору
	|ИЗ
	|	ВТ_Дог КАК ВТ_Дог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Дог.Организация,
	|	ВТ_Дог.Контрагент,
	|	ВТ_Дог.ДоговорКонтрагента";	
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	//Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.СуммаПоДоговору;
	Иначе
		Возврат 0;
	КонецЕсли;
		
КонецФункции 

Функция ПолучитьСуммуЗаМесяц_(Договор, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	АР_РасчетыПоДоговорамОстатки.СуммаОстаток
	//	|ИЗ
	//	|	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(
	//	|			&Дата,
	//	|			ДоговорКонтрагента = &ДоговорКонтрагента
	//	|				) КАК АР_РасчетыПоДоговорамОстатки";
	//
	//Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("Дата", Дата);
	////Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	//
	//РЗ = Запрос.Выполнить().Выбрать();
	//
	//Если РЗ.Следующий() Тогда
	//	Возврат РЗ.СуммаОстаток;
	//КонецЕсли;
	
	////////////////////////////////////////////////
	
	//"ВЫБРАТЬ
	//|	АР_РасчетыПоДоговорамОбороты.Организация КАК Организация,
	//|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	//|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	//|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору КАК СуммаПоДоговору,
	//|	АР_РасчетыПоДоговорамОбороты.Период КАК Период,
	//|	АР_РасчетыПоДоговорамОбороты.Регистратор
	//|ПОМЕСТИТЬ ВТ_Дог
	//|ИЗ
	//|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	//|ГДЕ
	//|	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.АР17_ПроведениеДоговораАренды
	//|	И АР_РасчетыПоДоговорамОбороты.СуммаОборот > 0
	//|	И АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	//|	АР_РасчетыПоДоговорамОбороты.Организация,
	//|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	//|	АР_РасчетыПоДоговорамОбороты.Период,
	//|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	//|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Организация КАК Организация,
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент КАК Контрагент,
	//|	ВТ_Дог.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//|	СУММА(ВТ_Дог.Регистратор.СуммаПоДоговору) КАК СуммаПоДоговору
	//|ИЗ
	//|	ВТ_Дог КАК ВТ_Дог
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Дог.Регистратор.ДоговорКонтрагента,
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент,
	//|	ВТ_Дог.Регистратор.ДоговорАренды.Организация";	
	//
	//Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	//
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	//Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	////Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	//
	//РЗ = Запрос.Выполнить().Выбрать();
	//
	//Если РЗ.Следующий() Тогда
	//	Возврат РЗ.СуммаПоДоговору;
	//Иначе
	//	Возврат 0;
	//КонецЕсли;
	
	/////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_РасчетыПоДоговорамОбороты.Организация КАК Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот КАК СуммаПоДоговору,
	|	АР_РасчетыПоДоговорамОбороты.Период КАК Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_Дог
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	|ГДЕ
	|	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.АР17_ПроведениеДоговораАренды
	|	И АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И АР_РасчетыПоДоговорамОбороты.СуммаОборот > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	|ГДЕ
	|	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|	И АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	|	АР_РасчетыПоДоговорамОбороты.СуммаОборот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дог.Организация КАК Организация,
	|	ВТ_Дог.Контрагент КАК Контрагент,
	|	ВТ_Дог.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ВТ_Дог.СуммаПоДоговору) КАК СуммаПоДоговору
	|ИЗ
	|	ВТ_Дог КАК ВТ_Дог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Дог.Организация,
	|	ВТ_Дог.Контрагент,
	|	ВТ_Дог.ДоговорКонтрагента";	
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	//Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.СуммаПоДоговору;
	Иначе
		Возврат 0;
	КонецЕсли;

		
КонецФункции 


Функция ПолучитьОЗ(Договор, Дата)
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВложенныйЗапрос.СчетНаАренду
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СчетНаАренду КАК СчетНаАренду,
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаРасход КАК СуммаРасход
	//|	ИЗ
	//|		РегистрНакопления.АР_ВзаиморасчетыПоАренде.ОстаткиИОбороты(, , , , СчетНаАренду.Контрагент = &Контрагент) КАК АР_ВзаиморасчетыПоАрендеОстаткиИОбороты
	//|	ГДЕ
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаКонечныйОстаток <= 0
	//|		И НЕ АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СчетНаАренду ЕСТЬ NULL ) КАК ВложенныйЗапрос
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АР_СчетНаАренду.Ссылка КАК СчетНаАренду,
	//|	АР_СчетНаАренду.СуммаДокумента
	//|ИЗ
	//|	Документ.АР17_СчетНаАренду КАК АР_СчетНаАренду
	//|ГДЕ
	//|	НЕ АР_СчетНаАренду.Ссылка В
	//|				(ВЫБРАТЬ
	//|					ВТ.СчетНаАренду
	//|				ИЗ
	//|					ВТ)
	//|	И АР_СчетНаАренду.Контрагент = &Контрагент
	//|	И АР_СчетНаАренду.ПометкаУдаления = ЛОЖЬ";
	//
	//Запрос.УстановитьПараметр("Контрагент", Отчет.Контрагент);
	////Запрос.УстановитьПараметр("КонецПериода", КонецДня(Отчет.КонецПериода));	
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//
	//
	//Возврат ТЗ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР_РасчетыПоСчетамБухОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто1 КАК Субконто1,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2 КАК СчетНаАренду,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2.НачалоПериода КАК НачалоПериода,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&Период, Счет = &Счет, , Субконто1 = &Договор) КАК АР_РасчетыПоСчетамБухОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО АР_РасчетыПоСчетамБухОстатки.Субконто1 = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2.Дата";
				   
	Запрос.УстановитьПараметр("Период",Дата);
	Запрос.УстановитьПараметр("Договор",Договор.ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("Договор",Источник.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга"));
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

Функция РазбитьПериод(ДатаС, ДатаПО)
	//Ответ = Новый Массив;
	//Мес = НачалоМесяца(ДатаС);
	//Пока Мес <= ДатаПО Цикл
	//	Д = Мин(ДатаПО,КонецМесяца(Мес));
	//    Ответ.Добавить(Новый Структура("Месяц", Формат(Д,"ДФ='ММММ yyyy'")));
	//    Мес = ДобавитьМесяц(Мес, 1)
	//КонецЦикла;     
	//Возврат Ответ
	
	Ответ = Новый Массив;
    Мес = НачалоМесяца(ДатаС);
    Пока Мес <= ДатаПО Цикл
        Ответ.Добавить(Новый Структура("НачалоПериода", Макс(ДатаС,Мес)));
        Мес = ДобавитьМесяц(Мес, 1)
    КонецЦикла;     
    Возврат Ответ
	
КонецФункции


Процедура СформироватьОтчетРасшифровка(НастройкиРасшифровки) Экспорт
	
	а=а;
	        //
			//ОтчетРасшифровка = Отчеты.АР_ОтчетПоНачислениям.Создать();
			//Форма = Объект.ПолучитьФорму("ФормаРасшифровка");
			//Форма.Открыть();
			//ОтчетРасшифровка.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
			//ОтчетРасшифровка.СформироватьОтчет();
			//
			
	//МакетСКД = Отчеты.АР_ОтчетПоНачислениям.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетРасшифровка = Отчеты.АР17_ОтчетПоНачислениям.ПолучитьМакет("Расшифровка");
	
	КомпоновщикНастроекРасшифровка = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекРасшифровка.ЗагрузитьНастройки(МакетРасшифровка.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроекРасшифровка.Настройки;//.ПолучитьНастройки();
	//
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
	//Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	//
	
	
	//ПараметрСКД = МакетСКД.Параметры.Найти("ВидДокумента");  
	//ПараметрСКД.Значение        = "Счета"; //НачалоПериода;  
	//ПараметрСКД.Использование   = ИспользованиеПараметраКомпоновкиДанных.Всегда; 
	//
	////ПараметрСКД = МакетСКД.Параметры.Найти("КонецПериода");  
	////ПараметрСКД.Значение        = КонецПериода;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

	////ПараметрСКД = МакетСКД.Параметры.Найти("Организация");  
	////ПараметрСКД.Значение        = Организация;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

	////МассивГрупп = Новый Массив;
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000120"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000094"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000025"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000110"));

	////ПараметрСКД = МакетСКД.Параметры.Найти("Группа");  
	////ПараметрСКД.Значение        = МассивГрупп;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

    ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// заполняем какие-то параметры
    Настройки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение; //"Счета";
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение;
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение;
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетРасшифровка, Настройки, ДанныеРасшифровкиОтчета);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиОтчета);

	//ДокументРезультат = Результат;
	//ДокументРезультат.Очистить(); 
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

КонецПроцедуры
